//1. 코틀린 기본(Primitive) 데이터 타입
//1-1. 2진수 표현
// Byte   용량 : 1, 저장가능범위 : -128 ~ 127

//1-2. 정수
// Short  용량 : 2, 저장가능범위 : -3만 2768 ~ 3만 2767
// Int    용량 : 4, 저장가능범위 : -21억 4748만 3648 ~ 21억 4748만 3647
// Long   용량 : 8, 저장가능범위 : -992경 3372조 0368억 5477만 5808 ~ 992경 3372조 0368억 5477만 5807

//1-3. 실수
// Float  용량 : 4, 저장가능범위 : 1.410-45 ~ 3.402823510308
// Double 용량 : 8, 저장가능범위 : 4.910-324 ~ 1.7976931...

//1-4. 문자 or 문자열
// Char     문자(숫자 제외) 1개 저장가능
// String   단어, 문장 등 문자열 저장가능

//1-5. 참 or 거짓
//Boolean   해당 조건에 대해 참(true)과 거짓(false)만 출력가능

//======================================================================================================================

//2. String - 문자열 타입
//2-1. 큰따움표에서 줄바꿈, 들여쓰기 유지 = \(역슬래시), 이스케이프 시퀀스 사용
val string1: String = "Hello \n World"

//2-2. 삼중따음표에서 줄바꿈, 들여쓰기
//삼중따움표 사용 시 .trimMargin() 자동 작성
//trimMargin() = 특정(ㅣ)문자열 앞부분 공백제거
val string2: String = """
    |Hello
    |World
""".trimMargin()

val string3: String = """Hello
    World
"""

//======================================================================================================================

//3. Any - 모든 타입가능





//======================================================================================================================

//4. Unit - 반환문이 없는 함수



//======================================================================================================================

//5. Nothing - null or 예외 반환 함수


//======================================================================================================================

//. 타입지정
//var 변수명 : 데이터 타입 = 값
//val 변수명 : 데이터 타입 = 값

//======================================================================================================================

//. 초기값 할당
//최상위(함수, 클래스 외부) 변수선언 시 선언과 동시에 초깃값 할당필수
//함수내부 선언변수는 변수 선언만 해도 상관없음
val val_data = 10   //val(value 줄임말) = 초기값 할당 후 값 변경불가
var var_data = 10   //var(variable 줄임말) = 초기값 할당 후 값 변경가능

//======================================================================================================================

//. 초기화 미루기 - 변수선언 시 초깃값을 할당불가한 경우
//컴파일러에게 이후에 초기값을 할당할 것이라고 알려야함 = lateinit, lazy

//-1. lateinit
//var 선언변수에서만 사용가능
//Int, Long, Short, Double, Float, Boolean, Byte 타입 사용불가
lateinit var var_lateinit: String

//-2. lazy
//변수가 최초로 실행되는 때 lazy 지정값 실행
//실행된 변수의 마지막 실행값 = lazy 초깃값으로 지정
val val_lazy: Int by lazy {
    10    //3. lazy 값 확인
}

fun main(){
    println("lazy 확인 중..")    //1. 문자열 출력
    println(val_lazy + 10)      //2. lazy 변수 확인       //4. lazy 값 + 10 출력
    println(val_lazy + 20)      //5. lazy 값  + 20 출력
}

//출력순서
//lazy 확인 중..   //20   //30

//======================================================================================================================


































