package Doit_안드로이드_책

// 01. 변수

//======================================================================================================================

//1. 타입지정
//var 변수명 : 데이터 타입 = 값
//val 변수명 : 데이터 타입 = 값

//======================================================================================================================

//2. 초기값 할당
//최상위(함수, 클래스 외부) 변수선언 시 선언과 동시에 초깃값 할당필수
//함수내부 선언변수는 변수 선언만 해도 상관없음
val val_data = 10   //val(value 줄임말) = 초기값 할당 후 값 변경불가
var var_data = 10   //var(variable 줄임말) = 초기값 할당 후 값 변경가능

//======================================================================================================================

//3. 초기화 미루기 - 변수선언 시 초깃값을 할당불가한 경우
//컴파일러에게 이후에 초기값을 할당할 것이라고 알려야함 = lateinit, lazy

//3-1. lateinit
//var 선언변수에서만 사용가능
//Int, Long, Short, Double, Float, Boolean, Byte 타입 사용불가
lateinit var var_lateinit: String

//3-2. lazy
//변수가 최초로 실행되는 때 lazy 지정값 실행
//실행된 변수의 마지막 실행값 = lazy 초깃값으로 지정
val val_lazy: Int by lazy {
    10    //3. lazy 값 확인
}

fun main(){
    println("lazy 확인 중..")    //1. 문자열 출력
    println(val_lazy + 10)      //2. lazy 변수 확인       //4. lazy 값 + 10 출력
    println(val_lazy + 20)      //5. lazy 값  + 20 출력

    println(unit_data1())
    println(unit_data2())
}

//출력순서
//lazy 확인 중..   //20   //30

//======================================================================================================================